{
  "intro": {
    "title": "המסע לחירות",
    "background": "scroll_background.jpg",
    "dialogue": [
      {
        "character": "rabbi_elazar",
        "text": "ילדים יקרים! אני רבי אלעזר הסופר, שומר המסורת וכותב דברי ימי ישראל. הנני נושא עמי את מגילת החירות המספרת את סיפור עמנו מימי אברהם אבינו ועד מתן תורה."
      },
      {
        "character": "rabbi_elazar",
        "text": "אך דפי המגילה התפזרו ברוח הזמן! אני זקוק לעזרתכם במסע מיוחד לאיסוף דפי המגילה ולחשיפת סיפור החירות של עם ישראל."
      },
      {
        "character": "rabbi_elazar",
        "text": "רק מי שיעבור את כל האתגרים ויבין את המשמעות העמוקה של הסיפור יוכל לשחזר את המגילה ולהבין את מהות החירות האמיתית!"
      },
      {
        "character": "miriam",
        "text": "שלום ילדים, אני מרים הנביאה. אני אעזור לכם לאורך המסע כשתצטרכו רמז או הכוונה. אל תהססו לפנות אליי!"
      }
    ],
    "actionButton": {
      "text": "בואו נתחיל במסע!",
      "next": "preliminary"
    }
  },
  "stages": [
    {
      "id": "preliminary",
      "type": "multi_stage",
      "title": "מסע אברהם - לך לך מארצך",
      "description": "דף המגילה הראשון - מסעו של אברהם אבינו",
      "background": "ancient_map_background.jpg",
      "character": "rabbi_elazar",
      "introDialogue": [
        {
          "character": "rabbi_elazar",
          "text": "הנה הדף הראשון של מגילת החירות! הוא מספר על תחילת המסע - על אברהם אבינו, שעזב את ביתו ואת ארצו, והלך בעקבות ה' אל הארץ המובטחת. זהו הצעד הראשון במסע אל החירות!"
        }
      ],
      "challenges": [
        {
          "id": "abrahams_journey",
          "type": "drag_drop",
          "title": "מסעו של אברהם",
          "description": "עזרו לאברהם למקם את האירועים במקומות הנכונים במפה",
          "sourceReference": {
            "source": "וַיֹּאמֶר ה' אֶל אַבְרָם לֶךְ לְךָ מֵאַרְצְךָ וּמִמּוֹלַדְתְּךָ וּמִבֵּית אָבִיךָ אֶל הָאָרֶץ אֲשֶׁר אַרְאֶךָּ (בראשית י\"ב, א')",
            "reference": "וַיֵּלֶךְ אַבְרָם כַּאֲשֶׁר דִּבֶּר אֵלָיו ה'... וַיִּקַּח אַבְרָם אֶת שָׂרַי אִשְׁתּוֹ וְאֶת לוֹט בֶּן אָחִיו... וַיֵּצְאוּ לָלֶכֶת אַרְצָה כְּנַעַן וַיָּבֹאוּ אַרְצָה כְּנָעַן. וַיַּעֲבֹר אַבְרָם בָּאָרֶץ עַד מְקוֹם שְׁכֶם... וַיְהִי רָעָב בָּאָרֶץ וַיֵּרֶד אַבְרָם מִצְרַיְמָה לָגוּר שָׁם כִּי כָבֵד הָרָעָב בָּאָרֶץ (בראשית י\"ב, ד'-י')"
          },
          "items": [
            {"id": "item1", "type": "text", "content": "יציאה מאור כשדים", "category": "mesopotamia"},
            {"id": "item2", "type": "text", "content": "הגעה לארץ כנען", "category": "canaan"},
            {"id": "item3", "type": "text", "content": "ירידה למצרים בגלל הרעב", "category": "egypt"},
            {"id": "item4", "type": "text", "content": "חזרה לארץ כנען", "category": "canaan2"}
          ],
          "dropZones": [
            {"id": "mesopotamia", "label": "מסופוטמיה", "mapLocation": {"x": 300, "y": 100}},
            {"id": "canaan", "label": "ארץ כנען", "mapLocation": {"x": 200, "y": 150}},
            {"id": "egypt", "label": "מצרים", "mapLocation": {"x": 150, "y": 250}},
            {"id": "canaan2", "label": "ארץ כנען (שוב)", "mapLocation": {"x": 200, "y": 150}}
          ],
          "hints": [
            "אור כשדים נמצאת בדרום מסופוטמיה (עיראק של היום)",
            "וַיְהִי רָעָב בָּאָרֶץ וַיֵּרֶד אַבְרָם מִצְרַיְמָה לָגוּר שָׁם כִּי כָבֵד הָרָעָב בָּאָרֶץ (בראשית י\"ב, י')",
            "המסע מתחיל בעיראק של היום, עובר דרך כנען (ישראל) ומגיע למצרים"
          ],
          "feedback": {
            "success": "כל הכבוד! אברהם אבינו יצא למסע ארוך ממסופוטמיה, דרך כנען, ירד למצרים בגלל הרעב וחזר לכנען. המרחק שעבר היה עצום במושגים של אותם ימים - מאות קילומטרים בדרכים מסוכנות ללא אמצעי תחבורה מודרניים."
          }
        },
        {
          "id": "abrahams_tests",
          "type": "matching",
          "title": "נסיונות אברהם",
          "description": "חברו בין הניסיון שעבר אברהם לערך שהוא מלמד אותנו",
          "sourceReference": {
            "source": "עֲשָׂרָה נִסְיוֹנוֹת נִתְנַסָּה אַבְרָהָם אָבִינוּ וְעָמַד בְּכֻלָּם (אבות ה', ג')",
            "reference": "המדרש מפרט את עשרת הניסיונות: 1. עזיבת ארצו 2. הרעב בארץ כנען 3. לקיחת שרה לבית פרעה 4. מלחמת המלכים 5. ברית בין הבתרים 6. המילה 7. לקיחת שרה לבית אבימלך 8. גירוש ישמעאל 9. גירוש הגר 10. עקידת יצחק"
          },
          "pairs": [
            {
              "id": 1,
              "item1": { "type": "text", "content": "לך לך מארצך" },
              "item2": { "type": "text", "content": "אמונה" }
            },
            {
              "id": 2,
              "item1": { "type": "text", "content": "רעב בארץ" },
              "item2": { "type": "text", "content": "סבלנות" }
            },
            {
              "id": 3,
              "item1": { "type": "text", "content": "לקיחת שרה לבית פרעה" },
              "item2": { "type": "text", "content": "בטחון בה'" }
            },
            {
              "id": 4,
              "item1": { "type": "text", "content": "עקידת יצחק" },
              "item2": { "type": "text", "content": "מסירות נפש" }
            }
          ],
          "shuffleItems": true,
          "hints": [
            "חשבו אילו מידות טובות נדרשו מאברהם בכל ניסיון",
            "לעזוב את הבית דורש אמונה, רעב מלמד להתאזר בסבלנות...",
            "כשלוקחים את אשתך צריך לבטוח בה', והעקידה היא שיא המסירות"
          ],
          "feedback": {
            "success": "יפה מאוד! המדרש מספר שאברהם עבר עשרה ניסיונות ועמד בכולם. כל ניסיון לימד ערך חשוב - מהאמונה הפשוטה ועד מסירות הנפש המוחלטת. אברהם הוא אבי האומה שלנו כי הוא היה הראשון שגילה את האמונה בה' והעביר אותה לדורות הבאים."
          }
        }
      ],
      "learningPopup": {
        "title": "מה למדנו בשלב זה?",
        "keyPoints": [
          "מסעו של אברהם כיסה מרחקים עצומים - מאור כשדים ועד ארץ כנען ומצרים",
          "אברהם הלך בעקבות הבטחת ה' בלי לדעת את היעד המדויק",
          "בכל מקום שהגיע, אברהם פרסם את שם ה' והפיץ את האמונה"
        ],
        "mainValue": "אמונה ומוכנות להתחיל מסע חדש גם כשהדרך לא ברורה לגמרי",
        "thinkingPoints": [
          "מתי בחיים שלנו אנחנו צריכים \"לך לך\" - לעזוב את אזור הנוחות?",
          "מה נותן לנו את הכוח ללכת בדרך לא מוכרת?"
        ],
        "familyActivity": "שוחחו בבית על 'מסע' משפחתי משמעותי שעברתם יחד - מעבר דירה, שינוי בחיים, או החלטה משותפת. מה למדתם מהמסע הזה?"
      }
    },
    {
      "id": "stage1",
      "type": "multi_stage",
      "title": "ברית בין הבתרים - הבטחה לדורות",
      "description": "ה' מבטיח לאברהם את ארץ ישראל ומתנבא על גלות מצרים",
      "background": "covenant_background.jpg",
      "character": "rabbi_elazar",
      "introDialogue": [
        {
          "character": "rabbi_elazar",
          "text": "אחרי שאברהם עזב את ביתו והגיע לארץ כנען, ה' כרת עימו ברית מיוחדת - ברית בין הבתרים. בברית זו, ה' הבטיח לאברהם את ארץ ישראל, אך גם בישר לו על גלות וסבל שיעברו צאצאיו במצרים לפני שיזכו לחירות."
        },
        {
          "character": "rabbi_elazar",
          "text": "דף זה של המגילה חשוב במיוחד, כי הוא מספר על התוכנית האלוקית ארוכת הטווח - הירידה למצרים והיציאה משם היו חלק מתוכנית אלוקית מראש!"
        }
      ],
      "challenges": [
        {
          "id": "covenant_ceremony",
          "type": "sorting",
          "title": "טקס הברית",
          "description": "סדרו את השלבים של ברית בין הבתרים לפי הסדר הנכון",
          "sourceReference": {
            "source": "וַיֹּאמֶר אֵלָיו קְחָה לִי עֶגְלָה מְשֻׁלֶּשֶׁת... וַיִּקַּח לוֹ אֶת כָּל אֵלֶּה וַיְבַתֵּר אֹתָם בַּתָּוֶךְ... וַיְהִי הַשֶּׁמֶשׁ בָּאָה... וְהִנֵּה תַנּוּר עָשָׁן וְלַפִּיד אֵשׁ אֲשֶׁר עָבַר בֵּין הַגְּזָרִים הָאֵלֶּה (בראשית ט\"ו)",
            "reference": "בברית בין הבתרים, אברהם חילק את החיות לשניים והניח את החצאים זה מול זה. לפי המסורת, דבר זה סימל את הבטחת ה' לנאמניו - כשם שהבהמות מחולקות כך מובטח שיקוים החלק השני של הברית. בחזיונו של אברהם עבר תנור עשן (המסמל את השכינה) בין החלקים."
          },
          "sortType": "chronological",
          "items": [
            { "id": "step1", "content": "ה' מצווה את אברהם לקחת בעלי חיים", "correctPosition": 1 },
            { "id": "step2", "content": "אברהם מחלק את בעלי החיים לשני חלקים", "correctPosition": 2 },
            { "id": "step3", "content": "אברהם נרדם ונופלת עליו תרדמה", "correctPosition": 3 },
            { "id": "step4", "content": "ה' מבשר לאברהם על שעבוד מצרים", "correctPosition": 4 },
            { "id": "step5", "content": "תנור עשן ולפיד אש עוברים בין הגזרים", "correctPosition": 5 }
          ],
          "hints": [
            "ראשית, ה' נותן הוראה מה להביא לטקס הברית",
            "ברית זו נקראת 'בין הבתרים' בגלל החלקים המבותרים",
            "הסדר הנכון הוא: הבאת בעלי החיים > ביתור > תרדמה > נבואה על גלות > טקס האש"
          ],
          "feedback": {
            "success": "יפה מאוד! סידרתם נכון את שלבי הברית. טקס זה היה אופייני לכריתת בריתות בתקופה העתיקה - הצדדים היו עוברים בין החלקים כדי לסמל את ההתחייבות ההדדית. במקרה זה, רק ה' (המסומל באש) עבר בין הגזרים, מה שמדגיש שההבטחה תלויה בו בלבד."
          }
        },
        {
          "id": "covenant_promises",
          "type": "fill_in_blanks",
          "title": "הבטחות הברית",
          "description": "השלימו את ההבטחות שניתנו לאברהם בברית",
          "sourceReference": {
            "source": "וַיֹּאמֶר לְאַבְרָם יָדֹעַ תֵּדַע כִּי גֵר יִהְיֶה זַרְעֲךָ בְּאֶרֶץ לֹא לָהֶם וַעֲבָדוּם וְעִנּוּ אֹתָם אַרְבַּע מֵאוֹת שָׁנָה... וְגַם אֶת הַגּוֹי אֲשֶׁר יַעֲבֹדוּ דָּן אָנֹכִי וְאַחֲרֵי כֵן יֵצְאוּ בִּרְכֻשׁ גָּדוֹל (בראשית ט\"ו, י\"ג-י\"ד)",
            "reference": "בברית, ה' מגלה לאברהם מספר פרטים על העתיד: 1) זרעו ישהה בארץ לא להם 2) יהיו עבדים ויסבלו 3) התקופה תימשך 400 שנה 4) ה' ישפוט את המשעבדים 5) בסוף התקופה יצאו ברכוש גדול. כל זה מראה שגלות מצרים לא הייתה מקרית אלא חלק מתוכנית אלוקית."
          },
          "text": "בני אברהם יחיו בארץ [blank1] להם, והם יהיו [blank2] ואותם גויים [blank3] אותם. התקופה תימשך ארבע מאות [blank4]. בסופו של דבר, ה' [blank5] את הגוי אשר יעבודו, ולאחר מכן יֵצְאוּ בִּרְכֻשׁ [blank6].",
          "blanks": {
            "blank1": {
              "answer": "לא",
              "caseSensitive": false,
              "acceptAlternatives": ["זרה", "נכרייה", "אחרת"]
            },
            "blank2": {
              "answer": "עבדים",
              "caseSensitive": false,
              "acceptAlternatives": ["משועבדים", "משרתים"]
            },
            "blank3": {
              "answer": "יענו",
              "caseSensitive": false,
              "acceptAlternatives": ["ענו", "עינו"]
            },
            "blank4": {
              "answer": "שנה",
              "caseSensitive": false,
              "acceptAlternatives": ["שנים"]
            },
            "blank5": {
              "answer": "דן",
              "caseSensitive": false,
              "acceptAlternatives": ["ישפוט", "יעניש"]
            },
            "blank6": {
              "answer": "גדול",
              "caseSensitive": false,
              "acceptAlternatives": ["רב"]
            }
          },
          "wordBank": ["לא", "עבדים", "יענו", "שנה", "דן", "גדול", "קטן", "יברך", "ישראל"],
          "showWordBank": true,
          "hints": [
            "שימו לב לפסוק המופיע במקור למעלה",
            "בני אברהם היו בארץ \"לֹא לָהֶם\" ושם \"וַעֲבָדוּם וְעִנּוּ אֹתָם\"",
            "הם ישתחררו מהשעבוד לאחר ש\"דָּן אָנֹכִי\", ויצאו \"בִּרְכֻשׁ גָּדוֹל\""
          ],
          "feedback": {
            "success": "מצוין! ה' מגלה לאברהם את העתיד הצפוי לבני ישראל - גלות, שעבוד, וגם את הגאולה והיציאה ברכוש גדול. חשוב להבין שהגלות והשעבוד לא היו מקריים, אלא חלק מתוכנית אלוקית. הסבל היה שלב הכרחי בדרך לחירות ולקבלת הארץ."
          }
        }
      ],
      "learningPopup": {
        "title": "מה למדנו בשלב זה?",
        "keyPoints": [
          "ברית בין הבתרים הייתה הסכם רשמי בין ה' לאברהם",
          "ה' הבטיח לאברהם את ארץ ישראל ובשר לו על עתיד זרעו",
          "גלות מצרים נחזתה מראש כחלק מהתוכנית האלוקית",
          "הגלות והשעבוד היו שלבים בדרך לחרות ולירושת הארץ"
        ],
        "mainValue": "חשיבות הסבלנות והאמונה בתוכנית ארוכת טווח. לפעמים, הדרך לחירות כוללת קשיים ואתגרים",
        "thinkingPoints": [
          "האם יש מצבים בחיינו שהם קשים אך מובילים למקום טוב יותר?",
          "איך אפשר לשמור על אמונה ותקווה גם בזמנים קשים?",
          "למה לפעמים צריך לעבור תקופות קשות כדי להעריך את החירות?"
        ],
        "familyActivity": "שוחחו על אתגר משפחתי שעברתם יחד - האם בדיעבד אתם רואים כיצד הוא תרם לחיזוק המשפחה או להתפתחות אישית?"
      }
    }
  ]
}